Autodesk.Revit.DB.Electrical.WireType.MaxSize
The max conductor size name of the wire type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The name is neither a conductor size name nor empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.WireType.Insulation
The conductor insulation material of the wire type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The id is not a conductor insulation material id nor invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.WireType.TemperatureRating
The conductor temperature rating of the wire type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The id is not a conductor temperature rating id nor invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.WireType.WireMaterial
The conductor material of the wire type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The id is not a conductor material id nor invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026